#!/usr/bin/env python
# -*- coding=utf-8 -*-

# 十六进制输出
print("%x" % 108)
print("%X" % 108)
print("%#x" % 108)

# 浮点型和科学计数法输出
print('%f' % 1245.7896)
print('%.2f' % 1245.7896)
print('%E' % 1245.7896)
print('%e' % 1245.7896)
print('%g' % 1245.7896)
print('%G' % 1245.7896)
print('%e' % (111111111111111))

# 整型和字符串输出
print("%+d" % 4)
print("%+d" % -4)
print("we are at %d%%" % 100)

"""输出结果
6c
6C
0x6c
1245.789600
1245.79
1.245790E+03
1.245790e+03
1245.79
1245.79
1.111111e+14
+4
-4
we are at 100%
"""
